app/controllers/listings_controller.rb

INSERT INTO "listings" ("name", "description", "price", "category", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", ""], ["description", ""], ["price", 54.0], ["category", ""], ["user_id", 1], ["created_at", "2021-08-14 03:46:12.722805"], ["updated_at", "2021-08-14 03:46:12.722805"]]
---
  def create
    @listing = Listing.new(listing_params)

    respond_to do |format|
      if @listing.save

UPDATE "listings" SET "updated_at" = $1 WHERE "listings"."id" = $2  [["updated_at", "2021-08-14 04:14:04.056282"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @listing.update(listing_params)